Repository: jasminndev/DjangoProject
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: User
ru: Пользователь
uz: Foydalanuvchi

source: Image
ru: Изображение
uz: Rasm

source: Caption
ru: Подпись
uz: Sharh

source: Created at
ru: Создано
uz: Yaratilgan vaqti

source: Updated at
ru: Обновлено
uz: Yangilangan vaqti

source: Is edited
ru: Редактировалось
uz: Tahrirlangan

source: Post
ru: Пост

source: Posts
ru: Посты
uz: Postlar

source: Post View
ru: Просмотр поста
uz: Post ko‘rilishi

source: Post Views
ru: Просмотры поста
uz: Post ko‘rilishlar

source: Comment text
ru: Текст комментария
uz: Izoh

source: Comment
ru: Комментарий
uz: Izoh

source: Comments
ru: Комментарии
uz: Izohlar

source: Like
ru: Нравится
uz: Layk

source: Likes
ru: Лайки
uz: Layklar

source: Comment cannot be empty
ru: Комментарий не может быть пустым
uz: Izoh bo'sh bo'lishi mumkin emas

source: Comment is too long (maximum 500 characters)
ru: Комментарий слишком длинный (максимум 500 символов)
uz: Izoh juda uzun (maksimal 500 belgi)

source: Image is required
ru: Изображение обязательно
uz: Rasm kiritilishi kerak

source: Image size cannot be exceed 10MB
ru: Размер изображения не может превышать 10 МБ
uz: Rasm hajmi 10MB dan katta bo‘lishi mumkin emas

source: Only JPEG, PNG, GIF and WebP images are allowed
ru: Разрешены только изображения в формате JPEG, PNG, GIF и WebP
uz: Faqat JPEG, PNG, GIF va WebP formatidagi rasmlar ruxsat etiladi

source: Caption is too long (maximum 2200 characters)
ru: Подпись слишком длинная (максимум 2200 символов)
uz: Sarlavha juda uzun (maksimal 2200 belgi)

source: Post created successfully
ru: Пост успешно создан
uz: Post muvaffaqiyatli yaratildi

source: Posts retrieved successfully
ru: Посты успешно получены
uz: Postlar muvaffaqiyatli yuklandi

source: Post deleted successfully
ru: Пост успешно удалён
uz: Post muvaffaqiyatli o'chirildi

source: Post updated successfully
ru: Пост успешно обновлён
uz: Post muvaffaqiyatli tahrirlandi

source: Post retrieved successfully
ru: Пост успешно получен
uz: Post muvaffaqiyatli yuklandi

source: Feed retrieved successfully
ru: Лента успешно получена
uz: Postlar muvaffaqiyatli yuklandi

source: Top posts retrieved successfully
ru: Топ-посты успешно получены
uz: Top postlar muvaffaqiyatli yuklandi

source: My posts retrieved successfully
ru: Мои посты успешно получены
uz: Mening yozuvlarim muvaffaqiyatli yuklandi

source: You have already liked this post
ru: Вы уже лайкнули этот пост
uz: Siz bu postni allaqachon yoqtirgansiz

source: Post liked successfully
ru: Пост успешно лайкнут
uz: Post muvaffaqiyatli yoqtirildi

source: Post unliked successfully
ru: Лайк с поста успешно снят
uz: Post yoqishi bekor qilindi

source: You have not liked this post
ru: Вы ещё не лайкнули этот пост
uz: Siz bu postni hali yoqtirmagansiz

source: Post likes retrieved successfully
ru: Лайки поста успешно получены
uz: Post yoqtirmalar muvaffaqiyatli yuklandi

source: Comment created successfully
ru: Комментарий успешно создан
uz: Izoh muvaffaqiyatli yaratildi

source: Comment deleted successfully
ru: Комментарий успешно удалён
uz: Izoh muvaffaqiyatli o'chirildi

source: Comments retrieved successfully
ru: Комментарии успешно получены
uz: Izohlar muvaffaqiyatli yuklandi

source: Follow
ru: Подписка
uz: Obuna bo'lish

source: Follows
ru: Подписки
uz: Obuna bo'lish

source: Follower
ru: Подписчик
uz: Kuzatuvchilar

source: Following
ru: Подписки на пользователей
uz: Kuzatyapti

source: Your account is deactivated.
ru: Ваш аккаунт деактивирован.
uz: Sizning profilingiz deaktivatsiya qilingan.

source: Email must be valid!
ru: Email должен быть корректным!
uz: Email manzili yaroqli bo‘lishi shart!

source: Email already registered!
ru: Этот email уже зарегистрирован!
uz: Email manzil allaqachon ro‘yxatdan o'tgan!

source: Username should contain only letters, numbers and underscores.
ru: Имя пользователя должно содержать только буквы, цифры и символы подчёркивания.
uz: Foydalanuvchi nomi faqat harflar, raqamlar va pastki chiziqdan iborat bo‘lishi shart.

source: Username must be at least 3 characters long.
ru: Имя пользователя должно содержать не менее 3 символов.
uz: Foydalanuvchi nomi kamida 3 ta belgidan iborat bo‘lishi kerak.

source: This username is not valid!
ru: Это имя пользователя недействительно!
uz: Bu foydalanuvchi nomi yaroqsiz!

source: This username is already taken!
ru: Это имя пользователя уже занято!
uz: Bu foydalanuvchi nomi allaqachon band!

source: Password must be 8–64 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character.
ru: Пароль должен содержать от 8 до 64 символов и включать как минимум одну заглавную букву, одну строчную букву, одну цифру и один специальный символ.
uz: Parol 8–64 ta belgidan iborat bo‘lishi va kamida bitta katta harf, bitta kichik harf, bitta raqam hamda bitta maxsus belgini o‘z ichiga olishi kerak.

source: Code must be 6 digits.
ru: Код должен состоять из 6 цифр.
uz: Kod 6 raqamdan iborat bo‘lishi kerak.

source: Invalid or expired code!
ru: Неверный или просроченный код!
uz: Kod yaroqsiz yoki amal qilish muddati tugagan!

source: Verification code sent successfully
ru: Код подтверждения успешно отправлен
uz: Tasdiqlash kodi muvaffaqiyatli yuborildi

source: Verification code is invalid or expired.
ru: Код подтверждения недействителен или просрочен.
uz: Tasdiqlash kodi yaroqsiz yoki amal qilish muddati tugagan.

source: Email verified successfully
ru: Email успешно подтверждён
uz: Elektron pochta manzili muvaffaqiyatli tasdiqlandi

source: Login successful
ru: Вход выполнен успешно
uz: Tizimga muvaffaqiyatli kirildi

source: User updated successfully
ru: Пользователь успешно обновлён
uz: Foydalanuvchi muvaffaqiyatli yangilandi

source: User deleted successfully
ru: Пользователь успешно удалён
uz: Foydalanuvchi muvaffaqiyatli o'chirildi

source: User profile retrieved successfully
ru: Профиль пользователя успешно получен
uz: Foydalanuvchi muvaffaqiyatli yuklandi

source: Users retrieved successfully
ru: Пользователи успешно получены
uz: Foydalanuvchilar muvaffaqiyatli yuklandi

source: Suggested users retrieved successfully
ru: Рекомендованные пользователи успешно получены
uz: Tavsiya qilingan foydalanuvchilar muvaffaqiyatli yuklandi

source: User posts retrieved successfully
ru: Посты пользователя успешно получены
uz: Foydalanuvchining postlari muvaffaqiyatli yuklandi

source: User not found
ru: Пользователь не найден
uz: Foydalanuvchi topilmadi

source: You can not follow yourself
ru: Вы не можете подписываться на себя
uz: Siz o‘zingizni kuzata olmaysiz

source: Follow already created
ru: Вы уже подписаны на этого пользователя
uz: Siz bu foydalanuvchini allaqachon kuzatyapsiz

source: You are now following %(username)s
ru: Вы теперь подписаны на %(username)s
uz: Siz %(username)s ni kuzatishni boshladingiz

source: You have unfollowed %(username)s
ru: Вы отписались от %(username)s
uz: Siz %(username)s ni kuzatishni to‘xtatdingiz

source: You are not following this user
ru: Вы не подписаны на этого пользователя
uz: Siz bu foydalanuvchini kuzatmaysiz

source: Followers retrieved successfully
ru: Подписчики успешно получены
uz: Kuzatuvchilar muvaffaqiyatli yuklandi

source: Following list retrieved successfully
ru: Список подписок успешно получен
uz: Siz kuzatayotganlar ro‘yxati muvaffaqiyatli yuklandi

source: Language updated successfully
ru: Язык успешно обновлён
uz: Til sozlamalari muvaffaqiyatli yangilandi

source: English
ru: Английский
uz: Inglizcha

source: Uzbek
ru: Узбекский
uz: O'zbekcha

source: Russian
ru: Русский
uz: Ruscha
